# print dataframe without header row

#### ===>header="None":In this function header row also include in dataframe with index 0.

In [42]:
import pandas as pd
df=pd.read_csv("fname.csv",header=None)
df

         0    1    2
0     Name   id  age
1     asdf   12   18
2    divya   13   18
3     tanu   14   18
4    madhu   15   19
..     ...  ...  ...
137   ammu  148  145
138   ammu  149  146
139   ammu  150  147
140   ammu  151  148
141   ammu  152  149

[142 rows x 3 columns]

#### ===>header=0:In this header row  function value is 0 doesnot include in dataframe.

In [44]:
df=pd.read_csv("fname.csv",header=0)

#### ===>header=False: In this false value is raising a type error

In [ ]:
df=pd.read_csv("fname.csv",header=False)

## using none function drop the header row

In [43]:
import pandas as pd
import numpy as np
df=pd.read_csv("fname.csv",header=None)
df1=df.drop(0)
df1

         0    1    2
1     asdf   12   18
2    divya   13   18
3     tanu   14   18
4    madhu   15   19
5      sai   16   19
..     ...  ...  ...
137   ammu  148  145
138   ammu  149  146
139   ammu  150  147
140   ammu  151  148
141   ammu  152  149

[141 rows x 3 columns]

# Linspace function:

The numpy linspace function is a tool in python for creating numeric sequences.
Similarly numpy arrange function in that it creates sequences of evenly spaced numbers.
In this Numpy linspace functioncreates sequences of evenly spaced values within a defined interval.
Ex:np.linspace(start=0,end=100,num=5)
==>This code produces nd array object(numpy array)
0-25-50-75-100

In [40]:
df4=np.linspace(0,100,5)
df4

array([  0.,  25.,  50.,  75., 100.])